angular.module('starter.controllers', [])

.controller("SideBarController", function ($scope, $ionicPlatform, $ionicSideMenuDelegate, $location, $ionicHistory) {

  $scope.toggleLeft = function () {
      $ionicSideMenuDelegate.toggleLeft();
  }

  $scope.toggleRight = function() {
    $ionicSideMenuDelegate.toggleRight();
  }
})

.controller('PocetnaCtrl', function($scope, $ionicLoading, $http) {
  $scope.show = function() {
    $ionicLoading.show({
      template: 'Учитавање обавештења...',
      duration: 1000
    });
  };
  $scope.hide = function(){
    $ionicLoading.hide();
  };
  //Pocetna controller
  $http.get('http://www.vtsnis.edu.rs/').success(function (data) {
    //Extract text using jquery
    $(function(){
      var $str = $(data);
      var htmlData = $str.find("td[colspan$='3']").text();
      var obavestenja = htmlData.replace(/\s\s\s+/g, ' ');
      $scope.sajt = obavestenja.replace(/О Б А В Е Ш Т Е Њ Е/g , '\n\nО Б А В Е Ш Т Е Њ Е\n\n').replace(/УПОЗОРЕЊЕ/g , '\n\nУПОЗОРЕЊЕ\n\n').replace(/КОНКУРС/g , '\n\nКОНКУРС\n\n');
    })
    //END OF Extract

  });
})

.controller('OSkoliCtrl', function($scope, $stateParams, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //O skoli controller
})

.controller('UpisCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //Upis controller
})

.controller('RasporedNastaveCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //Raspored Nastave controller
})

.controller('KalendarRadaCtrl', function($scope, VTSNisFactory, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();

  VTSNisFactory.getObject().then(function(response){
      $scope.meseci = response.Kalendar.Meseci;
      $scope.legenda = response.Kalendar.Legenda;
      $scope.ispitni_rokovi = response.Kalendar.Ispitni_rokovi;
  })


  //Kalendar Rada controller
})

.controller('KontaktCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //Kontakt controller
})
.controller('OsnovneCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleRight();
  //Osnovne studije controller
})
.controller('SpecijalistickeCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleRight();
  //Strukovne studije controller
})

.controller('StudijeSingleCtrl', function($scope, $ionicSideMenuDelegate, $stateParams) {
  var nazivSmera = '';
  var staIzucava = '';
  var opisSmera = '';
  var zvanje = '';
  var logoSmera = '';
  //Studije single controller
  switch ($stateParams.smerID) {
    case 'osn-industrijsko':
      nazivSmera = 'Индустријско инжењерство';
      staIzucava = 'Студенти се упознају са машинским конструкцијама, експлоатацијом и одржавањем машина, производним технологијама, развојем производа помоћу рачунара, менаџментом производње. Студијски програм индустријско инжењерство образује студенте да примењују разноврсне методе и користе савремене алате како би постали квалитетни инжењери који се баве пословима у производној индустрији. На тај начин, наши инжењери анализом захтева и расположивих ресурса конструишу производе, процењују и реално сагледавају проблеме из праксе, али и преносе своје инжењерско знање и вештине у друге области и пројекте.';
      opisSmera = 'Савладавањем овог студијског програма студенти стичу следеће компетенције:• да прикупљају, анализирају и систематизују теоретске и практичне проблеме из инжењерске праксе и да предвиде решења и последице при решавању тих проблема,• да владају основним дисциплинама у области индустријског инжењерства, као и савременим информационим технологијама на нивоу који се очекује од инжењера овог типа и у земљама ЕУ, • да користе литературу и инжењерске алате за прорачуне, моделирање, симулацију, а све у циљу овладавања знањима из овог подручја, • да примењују инжењерске, организационе и административне мере за безбедан рад са машинама, уређајима и опремом.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер индустријског инжењерства.';
      break;

    case 'osn-drumski':
      nazivSmera = 'Друмски саобраћај';
      staIzucava = 'Студијски програм омогућава изучавање и стицање битних знања из области безбедности саобраћаја, регулисања стационарног и динамичког саобраћаја, саобраћајног планирања и пројектовања, технлогије транспорта, експлоатације и одржавања моторних возила, комбинованог и унутрашњег транспорта, механизације претовара, логистике, као и других општих и техничких дисциплина које су директно или индиректно везане за друмски саобраћај (психологија, менаџмент, машинство, грађевинарство, рачунарство и информатика, заштита животне средине итд). Решавање комплексних саобраћајних и транспортних проблема захтева специјализована и мултидисциплинарна знања у циљу налажења решења која задовољавају постављене критеријуме (безбедност, поузданост, рентабилност, профитабилност и др.).';
      opisSmera = ' Савладавањем овог студијског програма студенти су способни да решавају практичне проблеме из праксе саобраћајног инжењерства и стичу следеће компетенције: • анализа и превенција саобраћајних незгода, анализа система обуке возача, предлагање мера и акција за повећање безбедности у саобраћају. • планирање мобилности, решавање проблема паркирања у урбаним срединама, анализа саобраћајних токова и пројектовање саобраћајне сигнализације. • организација рада у путничком и теретном саобраћају. • праћење робних токова у међународном робном промету, организовање транспорта применом модерних технологија комбинованог транспорта.';
      zvanje = ' Након завршених трогодишњих студија студент стиче звање Струковни инжењер саобраћаја.';
      break;

    case 'osn-komunikacione':
      nazivSmera = 'Комуникационе технологије';
      staIzucava = 'Студенти се упознају са примењеном информатиком, рачунарском техником, базама података, комуникационим уређајима, мрежама, пројектују помоћу рачунара, одржавају и сервисирају рачунарску, информациону, комуникациону и мрежну опрему, постају специјалисти за мерење и тестирање исте, основних концепата дигиталне радио и телевизијске технике, бежичних и мобилних комуникација, аналогних и дигиталних централа, интегралног техничког обезбеђења простора и објеката, мултимедија, програмских језика. Овај студијски програм образује студенте за успешно бављење комуникационим технологијама у производњи, одржавању, технологији и експлоатацији средстава рада.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да пројектује и одржава телекомуникационе системе, сателитску и кабловску опрему, • да пројектује, изгради и одржава кабловске дистрибуиране системе, кућне информационе системе, Интернет систем и GPS (Global Position System) системе, • да пројектује, примени, одржава бежичне мобилне комуникације, рачунарске мреже, аудио, видео и опрему за надзор и заштиту објеката.';
      zvanje = ' Након завршених трогодишњих студија студент стиче звање Струковни инжењер електротехнике и рачунарства.';
      break;

    case 'osn-savremene':
      nazivSmera = 'Савремене рачунарске технологије';
      staIzucava = 'Студенти се упознају са примењеном информатиком, рачунарском техником, базама података, комуникационим уређајима и мрежама. Имају могућности да пројектују помоћу рачунара, одржавају и сервисирају рачунарску, информациону, комуникациону, мрежну опрему, постају специјалисти за мерење и тестирање такве опреме. Такође иаму прилику да изучавају мултимедије, програмске језике, програмирање мобилних уређаја, програмирање на WEB – у и WEB дизајнирање. Овај студијски програм образује студенте за успешно бављење различитим пословима у информационим технологијама, како у производњи тако и у њиховом одржавању и експлоатацији.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да програмира апликације, • да пројектује, креира и одржава базе података, • да пројектује и администрира рачунарске мреже, • да инсталира, подешава и одржава рачунарску и мрежну опрему, • да програмира на WEB –у, • да програмира мобилне уређаје, • да програмира микроконтролере, • да повезује и контролише различите уређаје путем рачунара.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер електротехнике и рачунарства.';
      break;

    case 'osn-gradjevinsko':
      nazivSmera = 'Грађевинско инжењерство';
      staIzucava = 'Студенти се упознају са примењеним грађевинарством у оквиру свих радова на реализацији пројекта изградње објеката високоградње, нискоградње и хидроградње (механика тла и фундирање, грађевинска механизација и технологија грађења, грађевинске, бетонске, металне и дрвене конструкције, завршне радове и инсталације, саобраћајнице, хидротехника, организација рада у грађевинарству са менаџментом, урбанистичко планирање). Овај студијски програм образује студенте за успешно бављење пословима грађевинског инжењера у производњи, одржавању, технологији и експлоатацији средстава рада у грађевинарству.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да користи релевантне материјале при извођењу грађевинских објеката, • да користи рачунарске технологије у циљу примене практичних знања ради пројектовања у грађевинарству, • да користи одговарајућу опрему, примени нове технологије у грађевинарству, • да руководи појединим фазама радова у оквиру високоградње, нискоградње и хидроградње, • да обавља инспекцијске послове у органима локалне самоуправе, • да пројектује поједине фазе у оквиру израде идејног и главног пројекта.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер грађевинског инжењерства.';
      break;

    case 'osn-zastita-zivotne':
      nazivSmera = 'Заштита животне средине';
      staIzucava = 'Студенти се упознају са уводним принципима заштите животне средине, одрживог развоја, алтернативним изворима енергије, методама мерења и контроле загађења, управљањем животним ресурсима, енергетском ефикасншћу, еко стандардима и техничким прописима, управљањем отпадом, комуналном изградњом, просторним планирањем, пројектовањем инфраструктуре. Овај студијски програм образује студенте за успешно бављење технологијама у заштити животне средине и просторног планирања, одрживог развоја, примењивања закона и прописа, а све у складу са светским, привредним и друштвеним развојем, као и са принципима заштите животне средине.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да прикупљају, анализирају и систематизују теоретске и практичне проблеме из области заштите животне средине и да предвиде решења и последице при решавању тих проблема, • да примењују законе и прописе, у складу са светским, привредним и друштвеним развојем, као и са принципима заштите животне средине. • да владају основним дисциплинама у области просторног планирања, као и заштите животне средине и савременим информационим технологијама, • да пројектују поједине фазе у оквиру израде идејног и главног пројекта у области просторног планирања.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер заштите животне средине.';
      break;

    default:

  }
  $scope.nazivSmera = nazivSmera;
  $scope.staIzucava = staIzucava;
  $scope.opisSmera = opisSmera;
  $scope.zvanje = zvanje;
})

.controller('SpecijalistickeSingleCtrl', function($scope, $ionicSideMenuDelegate, $stateParams) {
  var nazivSmera = '';
  var opisSmera = '';
  var logoSmera = '';
  //Studije single controller
  switch ($stateParams.smerID) {
    case 'spec-industrijsko':
      nazivSmera = 'Индустријско инжењерство';
      opisSmera = 'Савладавањем овог студијског програма студенти стичу следеће компетенције:• да прикупљају, анализирају и систематизују теоретске и практичне проблеме из инжењерске праксе и да предвиде решења и последице при решавању тих проблема,• да владају основним дисциплинама у области индустријског инжењерства, као и савременим информационим технологијама на нивоу који се очекује од инжењера овог типа и у земљама ЕУ, • да користе литературу и инжењерске алате за прорачуне, моделирање, симулацију, а све у циљу овладавања знањима из овог подручја, • да примењују инжењерске, организационе и административне мере за безбедан рад са машинама, уређајима и опремом.';
      break;

    case 'spec-drumski':
      nazivSmera = 'Друмски саобраћај';
      opisSmera = ' Савладавањем овог студијског програма студенти су способни да решавају практичне проблеме из праксе саобраћајног инжењерства и стичу следеће компетенције: • анализа и превенција саобраћајних незгода, анализа система обуке возача, предлагање мера и акција за повећање безбедности у саобраћају. • планирање мобилности, решавање проблема паркирања у урбаним срединама, анализа саобраћајних токова и пројектовање саобраћајне сигнализације. • организација рада у путничком и теретном саобраћају. • праћење робних токова у међународном робном промету, организовање транспорта применом модерних технологија комбинованог транспорта.';
      break;

    case 'spec-komunikacione':
      nazivSmera = 'Комуникационе технологије';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да пројектује и одржава телекомуникационе системе, сателитску и кабловску опрему, • да пројектује, изгради и одржава кабловске дистрибуиране системе, кућне информационе системе, Интернет систем и GPS (Global Position System) системе, • да пројектује, примени, одржава бежичне мобилне комуникације, рачунарске мреже, аудио, видео и опрему за надзор и заштиту објеката.';
      break;

    case 'spec-savremene':
      nazivSmera = 'Савремене рачунарске технологије';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да програмира апликације, • да пројектује, креира и одржава базе података, • да пројектује и администрира рачунарске мреже, • да инсталира, подешава и одржава рачунарску и мрежну опрему, • да програмира на WEB –у, • да програмира мобилне уређаје, • да програмира микроконтролере, • да повезује и контролише различите уређаје путем рачунара.';
      break;

    case 'spec-gradjevinsko':
      nazivSmera = 'Грађевинско инжењерство';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да користи релевантне материјале при извођењу грађевинских објеката, • да користи рачунарске технологије у циљу примене практичних знања ради пројектовања у грађевинарству, • да користи одговарајућу опрему, примени нове технологије у грађевинарству, • да руководи појединим фазама радова у оквиру високоградње, нискоградње и хидроградње, • да обавља инспекцијске послове у органима локалне самоуправе, • да пројектује поједине фазе у оквиру израде идејног и главног пројекта.';
      break;

    case 'spec-zastita-zivotne':
      nazivSmera = 'Заштита животне средине';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да прикупљају, анализирају и систематизују теоретске и практичне проблеме из области заштите животне средине и да предвиде решења и последице при решавању тих проблема, • да примењују законе и прописе, у складу са светским, привредним и друштвеним развојем, као и са принципима заштите животне средине. • да владају основним дисциплинама у области просторног планирања, као и заштите животне средине и савременим информационим технологијама, • да пројектују поједине фазе у оквиру израде идејног и главног пројекта у области просторног планирања.';
      break;

    default:
  }
  $scope.nazivSmera = nazivSmera;
  $scope.opisSmera = opisSmera;
})
