angular.module('starter.controllers', [])

.controller("SideBarController", function ($scope, $ionicPlatform, $ionicSideMenuDelegate, $location, $ionicHistory) {

  $scope.toggleLeft = function () {
      $ionicSideMenuDelegate.toggleLeft();
  }

  $scope.toggleRight = function() {
    $ionicSideMenuDelegate.toggleRight();
  }
})

.controller('PocetnaCtrl', function($scope, $ionicLoading, $http) {
  $scope.show = function() {
    $ionicLoading.show({
      template: 'Учитавање обавештења...',
      duration: 1000
    });
  };
  $scope.hide = function(){
    $ionicLoading.hide();
  };
  //Pocetna controller
  $http.get('http://www.vtsnis.edu.rs/').success(function (data) {
    //Extract text using jquery
    $(function(){
      var $str = $(data);
      var htmlData = $str.find("td[colspan$='3']").text();
      var obavestenja = htmlData.replace(/\s\s\s+/g, ' ');
      $scope.sajt = obavestenja.replace(/О Б А В Е Ш Т Е Њ Е/g , '\n\nО Б А В Е Ш Т Е Њ Е\n\n').replace(/УПОЗОРЕЊЕ/g , '\n\nУПОЗОРЕЊЕ\n\n').replace(/КОНКУРС/g , '\n\nКОНКУРС\n\n');
    })
    //END OF Extract

  });
})

.controller('OSkoliCtrl', function($scope, $stateParams, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //O skoli controller
})

.controller('UpisCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //Upis controller
})

.controller('RasporedNastaveCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //Raspored Nastave controller
})

.controller('KalendarRadaCtrl', function($scope, VTSNisFactory, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();

  VTSNisFactory.getObject().then(function(response){
      $scope.meseci = response.Kalendar.Meseci;
      $scope.legenda = response.Kalendar.Legenda;
      $scope.ispitni_rokovi = response.Kalendar.Ispitni_rokovi;
  })


  //Kalendar Rada controller
})

.controller('KontaktCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleLeft();
  //Kontakt controller
})
.controller('OsnovneCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleRight();
  //Osnovne studije controller
})
.controller('SpecijalistickeCtrl', function($scope, $ionicSideMenuDelegate) {
  angular.element(document.querySelector('#smeroviBtn')).addClass('hideButton');
  $ionicSideMenuDelegate.toggleRight();
  //Strukovne studije controller
})

.controller('StudijeSingleCtrl', function($scope, $ionicSideMenuDelegate, $stateParams) {
  var nazivSmera = '';
  var staIzucava = '';
  var opisSmera = '';
  var zvanje = '';
  var logoSmera = '';
  //Studije single controller
  switch ($stateParams.smerID) {
    case 'osn-industrijsko':
      nazivSmera = 'Индустријско инжењерство';
      staIzucava = 'Студенти се упознају са машинским конструкцијама, експлоатацијом и одржавањем машина, производним технологијама, развојем производа помоћу рачунара, менаџментом производње. Студијски програм индустријско инжењерство образује студенте да примењују разноврсне методе и користе савремене алате како би постали квалитетни инжењери који се баве пословима у производној индустрији. На тај начин, наши инжењери анализом захтева и расположивих ресурса конструишу производе, процењују и реално сагледавају проблеме из праксе, али и преносе своје инжењерско знање и вештине у друге области и пројекте.';
      opisSmera = 'Савладавањем овог студијског програма студенти стичу следеће компетенције:• да прикупљају, анализирају и систематизују теоретске и практичне проблеме из инжењерске праксе и да предвиде решења и последице при решавању тих проблема,• да владају основним дисциплинама у области индустријског инжењерства, као и савременим информационим технологијама на нивоу који се очекује од инжењера овог типа и у земљама ЕУ, • да користе литературу и инжењерске алате за прорачуне, моделирање, симулацију, а све у циљу овладавања знањима из овог подручја, • да примењују инжењерске, организационе и административне мере за безбедан рад са машинама, уређајима и опремом.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер индустријског инжењерства.';
      break;

    case 'osn-drumski':
      nazivSmera = 'Друмски саобраћај';
      staIzucava = 'Студијски програм омогућава изучавање и стицање битних знања из области безбедности саобраћаја, регулисања стационарног и динамичког саобраћаја, саобраћајног планирања и пројектовања, технлогије транспорта, експлоатације и одржавања моторних возила, комбинованог и унутрашњег транспорта, механизације претовара, логистике, као и других општих и техничких дисциплина које су директно или индиректно везане за друмски саобраћај (психологија, менаџмент, машинство, грађевинарство, рачунарство и информатика, заштита животне средине итд). Решавање комплексних саобраћајних и транспортних проблема захтева специјализована и мултидисциплинарна знања у циљу налажења решења која задовољавају постављене критеријуме (безбедност, поузданост, рентабилност, профитабилност и др.).';
      opisSmera = ' Савладавањем овог студијског програма студенти су способни да решавају практичне проблеме из праксе саобраћајног инжењерства и стичу следеће компетенције: • анализа и превенција саобраћајних незгода, анализа система обуке возача, предлагање мера и акција за повећање безбедности у саобраћају. • планирање мобилности, решавање проблема паркирања у урбаним срединама, анализа саобраћајних токова и пројектовање саобраћајне сигнализације. • организација рада у путничком и теретном саобраћају. • праћење робних токова у међународном робном промету, организовање транспорта применом модерних технологија комбинованог транспорта.';
      zvanje = ' Након завршених трогодишњих студија студент стиче звање Струковни инжењер саобраћаја.';
      break;

    case 'osn-komunikacione':
      nazivSmera = 'Комуникационе технологије';
      staIzucava = 'Студенти се упознају са примењеном информатиком, рачунарском техником, базама података, комуникационим уређајима, мрежама, пројектују помоћу рачунара, одржавају и сервисирају рачунарску, информациону, комуникациону и мрежну опрему, постају специјалисти за мерење и тестирање исте, основних концепата дигиталне радио и телевизијске технике, бежичних и мобилних комуникација, аналогних и дигиталних централа, интегралног техничког обезбеђења простора и објеката, мултимедија, програмских језика. Овај студијски програм образује студенте за успешно бављење комуникационим технологијама у производњи, одржавању, технологији и експлоатацији средстава рада.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да пројектује и одржава телекомуникационе системе, сателитску и кабловску опрему, • да пројектује, изгради и одржава кабловске дистрибуиране системе, кућне информационе системе, Интернет систем и GPS (Global Position System) системе, • да пројектује, примени, одржава бежичне мобилне комуникације, рачунарске мреже, аудио, видео и опрему за надзор и заштиту објеката.';
      zvanje = ' Након завршених трогодишњих студија студент стиче звање Струковни инжењер електротехнике и рачунарства.';
      break;

    case 'osn-savremene':
      nazivSmera = 'Савремене рачунарске технологије';
      staIzucava = 'Студенти се упознају са примењеном информатиком, рачунарском техником, базама података, комуникационим уређајима и мрежама. Имају могућности да пројектују помоћу рачунара, одржавају и сервисирају рачунарску, информациону, комуникациону, мрежну опрему, постају специјалисти за мерење и тестирање такве опреме. Такође иаму прилику да изучавају мултимедије, програмске језике, програмирање мобилних уређаја, програмирање на WEB – у и WEB дизајнирање. Овај студијски програм образује студенте за успешно бављење различитим пословима у информационим технологијама, како у производњи тако и у њиховом одржавању и експлоатацији.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да програмира апликације, • да пројектује, креира и одржава базе података, • да пројектује и администрира рачунарске мреже, • да инсталира, подешава и одржава рачунарску и мрежну опрему, • да програмира на WEB –у, • да програмира мобилне уређаје, • да програмира микроконтролере, • да повезује и контролише различите уређаје путем рачунара.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер електротехнике и рачунарства.';
      break;

    case 'osn-gradjevinsko':
      nazivSmera = 'Грађевинско инжењерство';
      staIzucava = 'Студенти се упознају са примењеним грађевинарством у оквиру свих радова на реализацији пројекта изградње објеката високоградње, нискоградње и хидроградње (механика тла и фундирање, грађевинска механизација и технологија грађења, грађевинске, бетонске, металне и дрвене конструкције, завршне радове и инсталације, саобраћајнице, хидротехника, организација рада у грађевинарству са менаџментом, урбанистичко планирање). Овај студијски програм образује студенте за успешно бављење пословима грађевинског инжењера у производњи, одржавању, технологији и експлоатацији средстава рада у грађевинарству.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да користи релевантне материјале при извођењу грађевинских објеката, • да користи рачунарске технологије у циљу примене практичних знања ради пројектовања у грађевинарству, • да користи одговарајућу опрему, примени нове технологије у грађевинарству, • да руководи појединим фазама радова у оквиру високоградње, нискоградње и хидроградње, • да обавља инспекцијске послове у органима локалне самоуправе, • да пројектује поједине фазе у оквиру израде идејног и главног пројекта.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер грађевинског инжењерства.';
      break;

    case 'osn-zastita-zivotne':
      nazivSmera = 'Заштита животне средине';
      staIzucava = 'Студенти се упознају са уводним принципима заштите животне средине, одрживог развоја, алтернативним изворима енергије, методама мерења и контроле загађења, управљањем животним ресурсима, енергетском ефикасншћу, еко стандардима и техничким прописима, управљањем отпадом, комуналном изградњом, просторним планирањем, пројектовањем инфраструктуре. Овај студијски програм образује студенте за успешно бављење технологијама у заштити животне средине и просторног планирања, одрживог развоја, примењивања закона и прописа, а све у складу са светским, привредним и друштвеним развојем, као и са принципима заштите животне средине.';
      opisSmera = 'Савладавањем овог студијског програма студент стиче следеће компетенције: • да прикупљају, анализирају и систематизују теоретске и практичне проблеме из области заштите животне средине и да предвиде решења и последице при решавању тих проблема, • да примењују законе и прописе, у складу са светским, привредним и друштвеним развојем, као и са принципима заштите животне средине. • да владају основним дисциплинама у области просторног планирања, као и заштите животне средине и савременим информационим технологијама, • да пројектују поједине фазе у оквиру израде идејног и главног пројекта у области просторног планирања.';
      zvanje = 'Након завршених трогодишњих студија студент стиче звање Струковни инжењер заштите животне средине.';
      break;

    default:

  }
  $scope.nazivSmera = nazivSmera;
  $scope.staIzucava = staIzucava;
  $scope.opisSmera = opisSmera;
  $scope.zvanje = zvanje;
})

.controller('SpecijalistickeSingleCtrl', function($scope, $ionicSideMenuDelegate, $stateParams) {
  var nazivSmera = '';
  var opisSmera = '';
  var logoSmera = '';
  //Studije single controller
  switch ($stateParams.smerID) {
    case 'spec-industrijsko':
      nazivSmera = 'Инжињерство заштите животне средине';
      opisSmera = ' Полазећи од дугогодишњег искуства у образовању инжењера различитих профила, а прилагођавајући се савременим захтевима и стандардима високошколског образовања, Висока техничка школа струковних студија у Нишу је јасно поставила и истакла опште и специфичне циљеве постојања студијског програма Инжењерство заштите животне средине. При изради садржаја студијског програма водило се рачуна о адекватном представљању тематике примене савремених технологија, из области заштите животне средине, као и што већој усклађености и прилагођености садржаја овог програма са сличним програмима високошколских установа у ЕУ, како би било обезбеђено укључивање студената на одговарајуће студијске програме у иностранству и брзо и ефикасно прилагођавање европском образовном простору, у складу са Болоњском декларацијом. Имајући у виду све своје ресурсе, Школа, кроз овај студијски програм, има јасно постављен и истакнут циљ да омогући студентима да прошире и продубе своја знања, стечена на основним студијама истог или сличног усмерења, а са намером стицања потпунијег и знања и разумевања метода заштите, обнављања и очувања животне средине. Конкретно, циљ овог студијског програма је образовање стручњака који поседује неопходно знање за успешно бављење следећим задацима: - развој нових зелених технологија (без отпада или са смањеним количинама) - развој метода за рециклирање (сакупљање, сортирање) индустријског и другог отпада у циљу стварања нових сировина и смањења загађења - коришћење алтернативних горива - одговорно управљање природним ресурсима (нарочито водом) - решавање проблема загађења вода, ваздуха и земљишта - увођење мера енергетске ефикасности у циљу постизања максималне продуктивности уз минималну потрошњу енергије - проучавање односа екосистема са другим системима (нарочито индустријским) - побошљање законске и нормативне регулативе у области заштите животне средине С обзиром на услове у којима ради наша индустрија и привреда уопште, постављени циљеви за будући профил стручњака, прилично су тешки, али се студенти обучавају да делују поступно на локалном и регионалном плану, а што може имати и глобалне ефекте. Поред овога Школа има и следеће опште циљеве: - постизање образовног процеса у складу са највишим стандардима и усклађеност са поставкама Болоњског процеса - образовање оријентисано ка студентима, њиховим стварним могућностима и способностима учења - креирање приступа учењу где је студент у центру едукације тј. прелазак са статичког држања наставе на наставу усмерену на студента. Студијски програм специјалистичких струковних студија Инжењерство заштите животне средине образује стручњаке који, у овом тренутку, недостају у профилу постојећих кадрова, с обзиром да је заштита животне средине релативно нова научна дисциплина и да постоје одређене празнине у високошколском образовању у овој области. На овај начин ће се обезбедити кадрови високог степена стручности за обављање сложених послова у области заштите животне средине.';
      break;

    case 'spec-drumski':
      nazivSmera = 'Безбедност друмског саобраћаја';
      opisSmera = 'Прилагођавајући се савременим захтевима и стандардима високошколског образовања, a у складу са потребама савременог друштва, Висока техничка школа струковних студија у Нишу је 2008. године, на специјалистичким студијама акредитовала студијски програм Безбедност друмског саобраћаја. Студијски програм конципиран је тако да представља специјализацију стручњака из уже области Безбедност и контрола саобраћаја, а представља савремени, усклађен, логичан и неопходнан наставак студијског програма друмски саобарћај на основним студијама. Садржај студијског програма рађен је у складу са Стандардима за акредитацију студијских програма, које је донео Национални савет за високо образовање. Студијски програм је у трајању од једне године (два семестра-60 ЕСПБ) и прилагођен је савременим европским искуствима у образовању овог профила стручњака. Студијски програм настао је као последица чињенице да последњих година, на светском нивоу, рад у области безбедности друмског саобраћаја доживљава велику експанзију. Узимајићи у обзир велики број саобраћајних незгода и штетност њихових последица, организација и рад у области безбедности друмског саобраћаја заузима значајно место у хијерархији приоритетних задатака савременог друштва. На свим нивоима организовања савремена друштва улажу огромне напоре како би се остварили што бољи резултати на смањењу броја саобраћајних незгода и њихових последица. Успостављање прихватљивог нивоа, односно жељеног стања, безбедности друмског саобраћаја подразумева, између осталог и константно унапређење образовања и стечених знања стручњака из ове области, што уједно представља основни циљ овог студијског програма. Основни или примарни циљ студијског програма је стицање стручних знања и практичних вештина из области Безбедности и контроле саобраћаја, односно постизање компетенција неопходних за обављање практичних послова и задатака из наведене области. Поред тога, овај студијски програм усмеран је ка развоју креативних способности студената који подразумева: идентификацију и анализу одређеног проблема, планирање и реализацију одговарајућих мера, развој критичког мишљења, доношење конкретних решења, писање стручних извештаја и саопштавање и јавно излагање постигнутих резултата рада. Крајњи циљ студијског програма Безбедност друмског саобраћаја је да образује стручњака који је током процеса студирања стекао потребна стручна знања и практичне вештине, која са стручног и практичног аспекта могу бити примењена на решавању практичних послова и проблема у области безбедности и контроле саобраћаја. Поред конкретних, постављени су и следећи општи циљеви судијског програма: усклађеност са поставкама Болоњског процеса, високи степен вертикалне и хоризонталне мобилности студената, теренска настава и практична реализација пројеката, тимски рад итд. Поред циљева, кроз студијски програм, постављени су и очекивани исходи учења, односно прецизни искази о томе шта ће студенти бити у стању да ураде након завршетка студија на овом студијском програму и колико ће то успешно обављати. Похађањем овог студијског програма студент стиче знања и практичне вештина које треба да га учине способним да индивидуално или у тиму решава конкретне и практичне проблеме из облати безбедности саобраћаја. Очекивани исходи учења су оспособљеност студента да стечена знања и вештине примени у пракси на следећим пословима: анализа саобраћајних незгода у циљу повећања нивоа безбедности саобраћаја; израда стратегије и тактике спречавања саобраћајних незгода на одређеном подручју; организација и спровођење увиђаја саобраћајних незгода; експертизе - вештачења саобраћајних незгода; организација рада центара за обуку возача; контрола и регулисање саобраћаја; експлоатација и одржавања путева са аспекта безбедниост саобраћаја. Генерално, очекивани исход учења је да се студент практично и теоријски оспособи да постане квалитетан специјалиста - струковни инжењер саобраћаја у пракси, а што се постиже активном наставом, низом практичних вежби, обављањем праксе у некој од радних организација, израдом конкретних пројектних задатака, итд.';
      break;

    case 'spec-komunikacione':
      nazivSmera = 'Комуникационе технологије';
      opisSmera = 'Висока техничка школа струковних студија у Нишу има дугогодишње искуство у организацији и остваривању студија из области електротехнике, електронике, комуникационе и рачунарске технике. Прилагођавајући се савременим захтевима и стандардима високошколског образовања и стандардима Болоњске декларације, Висока техничка школа је у првом циклусу акредитовала специјалистички студијски програм Комуникационе технологије. Концепција студијског програма је таква да он представља наставак раније акредитованог програма Комуникационе технологије на основним струковним студијама. Овај студијски програм настао је као последица потребе да се ствара високообразовани стручни кадар који ће бити у стању да активно прати и утиче на кретања у области комуникационих технологија. Садржај студијског програма рађен је у складу са Стандардима за акредитацију студијских програма другог степена струковних студија, које је донео Национални савет за високо образовање. Студијски програм је у трајању од једне године (два семестара - 60 ЕСПБ) и прилагођен је савременим европским искуствима у образовању овог профила стручњака. Приликом прављења елабората за акредитацију, циљ постојања овог студијског програма био је јасно постављен и истакнут, а то је стицање општих и стручних знања, као и вештина за укључивање у радни процес и квалитетно обављање струковне делатности из области Комуникационих технологија. Другим речима, основни или примарни циљ студијског програма је стицање општих и стручних знања и вештина из области комуникација (мобилне, сателитске, оптичке комуникације, обраде сигнала, рачунарске технике и др.). Поред конкретних, постављени су и следећи општи циљеви студијског програма: усклађеност са поставкама Болоњског процеса, високи степен вертикалне и хоризонталне мобилности студената, теренска настава и практична реализација пројеката, тимски рад као и и флексибилна организација студија по жељи сваког студента (прилагођавање програмског садржаја студија афинитетима студента, али уз задржавање обима стручних знања које осигуравају да се задржи програмско језгро специјалистичких студија). Поред циљева, постављени су и очекивани исходи учења, тј. прецизни искази о томе шта ће студенти бити у стању да ураде или направе након завршетка студија на овом студијском програму. Након завршетка студија студенти су оспособљени за примену савремених техничко-технолошких метода у циљу решавања конкретних проблема и задатака из области комуникација и рачунарства, а наравно и овладавање специфичних практичних вештина потребних за обављање свих делатности везаних за област комуникационих технологија, рачунарства, софтвера и хардверских комоненти, уз примену и праћење новина у струци. Генерално, очекивани исход учења је да се студент у току студија практично и теоријски оспособљава да постане добар инжењер-специјалиста струке у пракси.';
      break;

    case 'spec-savremene':
      nazivSmera = 'Савремене рачунарске технологије';
      opisSmera = 'Пратећи савремене захтеве који се стално постављају као неопходни услов за образовање високошколских стручњака, а ускладу са потребама савременог друштва и стандардима Болоњске декларације, Висока техничка школа струковних студија у Нишу је 2008. године, на специјалистичким студијама акредитовала студијски програм САВРЕМЕНЕ РАЧУНАРСКЕ ТЕХНОЛОГИЈЕ. Студијски програм настао је као последица чињенице да је незамислив напредак било ког друштва без стручњака овог профила. Овај студијски програм конципиран је да представља природни наставак трогодишњег студијског програма Савремене рачунарске технологије на основним студијама и усмерен је да изврши специјалзацију стручњака из уже области са подручја савремених рачунарских технологија. Садржај студијског програма рађен је у складу са Стандардима за акредитацију студијских програма, које је донео Национални савет за високо образовање. Студијски програм је у трајању од једне године (два семестра по 60 ЕСПБ) и прилагођен је савременим европским искуствима у образовању овог профила стручњака. Приликом акредитације, циљ постојања овог студијског програма био је јасно постављен и истакнут, а то је оспособљавање кадрова за укључивање у радни процес и квалитетно и компетентно обављање струковне делатности из рачунарских технологија. Основни циљ специјалистичких струковних студија из Савремених рачунарских технологија јесте да се на адекватан начин представи тематика примене информатике у привреди и друштву. Ово студенти остварују кроз једино мерљиву категорију исхода: поседују знања и вештине које одмах могу да примене у пракси. Таква знања и специфично – практичне вештине које су стекли у току студирања, везане су за различите примене Савремених рачунарских технологија. Ове вештине потребне су друштву за обављање читавог низа задатака из ове области ( успешно бављење информационим технологијама у производњи, одржавању, технологији и експлоатацији средстава рада а све у складу са светским искуствима у области професионалне едукације ). Поред конкретних, постављени су и следећи општи циљеви судијског програма: усклађеност са поставкама Болоњског процеса, високи степен вертикалне и хоризонталне мобилности студената, избор програмских садржаја (велики број изборних предмета), теренска настава и практична реализација пројеката, тимски рад и флексибилна организација студија по жељи сваког студента ( прилагођавање програмског садржаја студија афинитетима студента, али уз задржавање обима стручних знања које осигуравају да се задржи програмско језгро специјалистичких студија ). Поред циљева, постављени су и очекивани исходи учења тако да су студенти након завршетка ових студија оспособљени да самостално или у тимском раду обављају многе послове од велике важности за опште техничке и информатичке токове у региону. Притом постају потпуно оспособљени за улазак у нови свет савременог Информатичког доба. Циљеви укључују развој креативних способности студената, вештину и знање за решавање конкретних проблема, а наравно и овладавање специфичних практичних вештина потребних за обављање ове професије уз примену и континуирано праћење новина у струци. На крају, циљ студијског програма је да се студент се у току студија практично и теоријски оспособи да постане пре свега добар инжeњер – струковни специјалиста у пракси. Такав његов самосталан и тимски рад омогућен је активном наставом и читавим низом практичних вежби, које похађа у току студија као и обављањем праксе у некој од радних организација и израдом стручног пројекта и специјалистичког рада на крају овог школовања.';
      break;

    case 'spec-gradjevinsko':
      nazivSmera = 'Комунално инжењерство';
      opisSmera = 'Висока техничка школа струковних студија у Нишу има дугогодишње искуство у организацији и остваривању студија из области грађевинарства. Прилагођавајући се савременим захтевима и стандардима високошколског образовања, Висока технича школа је, у првом циклусу, акредитовала студијски програм Комунално инжењерство, који представља наставак основних струковних студија и представља наставак образовања и специјализацију у смеру комуналног инжењерстава. Садржај студијског програма рађен је у складу са Стандардима за акредитацију студијских програма другог степена струковних студија, које је донео Национални савет за високо образовање. Студенти своје вештине и знања стичу преко реализације студијског програма кроз једногодишње студије са два семестара (60 ЕСПБ), уз најсавременији наставни процес интерактивне теоријске и практичне наставе. Приликом акредитације, циљ постојања овог студијског програма је образовање и оспособљавање стручњака из области грађевинског инжењерства, за рад у разнородним и динамичним подручијима свих области грађевинарства. Студијски програм конципиран је тако, да студентима даје одређени ниво способности, да може самостално и тимски да учествују у реализацији грађевинских пројеката на изградњи објеката комуналне инфраструктуре. Осим тога, студијски програм даје одређени ниво способности за пројектовање објеката грађевинарства. Свеукупно сагледано, општи циљеви судијског прогама били би усклађеност са поставкама Болоњског процеса, да се на адекватан начин представи тематика примене савремених технологија из области грађевинарства у комуналном инжењерству, високи степен вертикалне и хоризонталне мобилности студената, теренска настава и практична реализација пројеката. Поред циљева, постављени су и очекивани исходи учења. По завршетку специјалистичких студија студенти стичу компетенције да самостално и у тимском раду обављају многе послове од значаја за комуналне проблеме у грађевинарству. Притом постају потпуно оспособљени за решавање насталих проблема у току реализације пројекта, или у току израде пројекта објеката грађевинарства. Такође су спосбни да прикажу своје креативне способности, вештину и знање за решавање конкретних проблема, а наравно и овладавање специфичних практичних вештина, потребних за обављање ове професије уз примену и праћење новина у струци. Наши студенти су оспособљени да самоатално и у тиму изврше израду студија и израду процене изградње грађевинских и комуналних објеката, изврше планирање, израде техничку документацију и управљају изградњом објеката комуналне инфраструктуре. Генерално, очекивани исход учења је да се студент у току студија практично и теоријски оспособљава да постане добар инжењер струке у пракси.';
      break;

    default:
  }
  $scope.nazivSmera = nazivSmera;
  $scope.opisSmera = opisSmera;
})
